test.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:EnvioFacturaElectronicaPeticion xmlns:ns0="http://www.dian.gov.co/servicios/facturaelectronica/ReportarFactura">
      <ns0:NIT>1015420690</ns0:NIT>
      <ns0:InvoiceNumber>001</ns0:InvoiceNumber>
      <ns0:IssueDate>2017-11-13T17:27:21.010872</ns0:IssueDate>
      <ns0:Document>WkdGMFlTQjBieUJpWlNCbGJtTnZaR1Zr</ns0:Document>
    </ns0:EnvioFacturaElectronicaPeticion>
  </soap-env:Body>
</soap-env:Envelope>
